_posts/2018-05-26-intro-to-combinatory-ad.org
#+STARTUP: showall indent
#+BEGIN_EXPORT html
---
layout: post
title: Introduction to Combinatory Automatic Differentiation
excerpt: A basic overview of a new method of automatic differentiation.
---
#+END_EXPORT

In this blog post, I will describe the basics of a new form of Automatic Differentiation (AD) that I will be implementing in Haskell for the Google Summer of Code, along with some background and why it is expected that the method will yield a speedup for practical problems.

* Introduction

There's a lot of digital ink that's been spilled on the subject of AD, so I'll outsource the description elsewhere.
If you want to learn more about AD, or the terms "forward-mode" and "reverse-mode" don't mean anything to you, [[http://www.danielbrice.net/blog/automatic-differentiation-is-trivial-in-haskell/][here]] are some good [[http://h2.jaguarpaw.co.uk/posts/reverse-mode-automatic-differentiation/][Haskell-based articles]] on the subject.

AD is useful for a wide range of quantitative problems, and it is used extensively in machine learning and optimization---especially in neural networks.
A lot of the work that goes into ML research is calculus: you compute the derivatives of some loss function you want to optimize, and stuff them into some kind of gradient descent woodchipper.
AD lets you avoid doing these calculations by hand, and focus on dreaming up new things to optimize.

The problem is that AD can be significantly slower than hand-coded gradient computation.
Moreover, [[https://pdfs.semanticscholar.org/dd3c/a38dc66b7f93b124bb7dc5dfa8601d87b3da.pdf][optimal Jacobian accumulation is NP-complete]].

* The new method

The method I'll be working on this summer takes a new approach to AD, and is based on in-progress work by Martin Elsman, Fritz Henglein, Gabriele Keller, Ken Friis Larsen, and Dimitrios Vytionitis.
They refer to the method as "combinatory automatic differentiation", although I think "point-free automatic differentiation" also captures the basic idea.

There's a lot more to say about the method, but I'll stick to a high-level overview here.

First, some notation: denote function composition by $\circ$, and composition of linear maps by $\bullet$.
The [[https://en.wikipedia.org/wiki/Fr%C3%A9chet_derivative][Frechet derivative]] (a generalization of the usual derivative to maps between Banach spaces, which spits out the Jacobian when applied to $f: \mathbb{R}^m \to \mathbb{R}^n$) is a linear map, and therefore we can write the chain rule like so: \[
(f \circ g)'(x) = f'(g(x)) \bullet g'(x)
\]
In the finite dimensional case, $\bullet$ is matrix multiplication, which has two key attributes.
- It is amenable to parallelization and GPU friendly
- People have been working on making implementations go faster since computers were invented.

How does this help us?

Suppose we have written our program $f$ as a long series of function compositions. \[
f = f_k \circ f_{k-1} \circ \cdots \circ f_2 \circ f_1
\]
We can always do this with pure functional code, even if the result is extremely hard to understand.
The Jacobian accumulation problem can then be understood as asking us to choose the parenthetical association of functions which is operation-count-optimal after the chain rule is applied.
(Since function composition is associative, all associations will all give the same answer, but some will be faster than others.)
As special cases, we have forward mode AD \[
f = f_k \circ (f_{k-1} \circ (\cdots \circ (f_2 \circ f_1) \cdots))
\]
and reverse mode AD \[
f = (\cdots(f_k \circ f_{k-1}) \circ \cdots \circ f_2) \circ f_1
\]

The main insight of the combinatory method is that working at the level of these function trains allows us to extract data parallelism from the chain rule, as long as we take care to avoid expression swell and optimize where possible.
(I will discuss both of these topics in the future.)
In the combinatory setting, the derivative of our function train might look like this \[
f' = ( \cdots (f_k \circ f_{k-1}) \circ \cdots \circ f_{k-p})' \bullet (f_j \circ f_{j-1})'
 \bullet (\cdots(f_m \circ f_{m-1}) \circ \cdots \circ f_{m-n})' \bullet \cdots \bullet (f_2 \circ f_1)'
\]
If we split up the function train wisely, we'll be able to spend most of our computational time doing two things when applying AD to practical problems.
- Evaluating a Jacobian/Hessian matrix (mostly in parallel)
- Parallel matrix multiplication

