_posts/2018-05-26-intro-to-combinatory-ad.org
* Sketch of an implementation

I'll now describe a quick and dirty prototype implementation of the idea, which is extremely inefficient---it uses list-based matrix multiplication, among other things.

We'll begin with some imports.
#+BEGIN_SRC haskell
import Data.List (transpose)
#+END_SRC

For simplicity, we'll use an extremely sparse expression datatype, which is understood as the point-free composition of functions.
Eventually, this will be replaced by the AST of =accelerate=.
The =Pi= constructor represents projection onto the \(k\)-th component of a tuple, and it replaces variables.
(Think of it as a kind of de Bruijn indexing.)
#+BEGIN_SRC haskell
data AdExpr = Constant Double
  | Pi Int
  | Plus AdExpr AdExpr
  | Times AdExpr AdExpr
  deriving (Show, Eq)
#+END_SRC

Let's define a partial =Num= instance for =AdExpr=, so we can write things in a nicer way.
#+BEGIN_SRC haskell
instance Num AdExpr where
  (+) = Plus
  (*) = Times
  fromInteger i = Constant (fromInteger i)
#+END_SRC

Next, we'll define an evaluator for our simple AST at a vector =v=.
#+BEGIN_SRC haskell
evalAd :: AdExpr -> [Double] -> Double
evalAd (Constant x) _ = x
evalAd (Pi i) v = v !! i
evalAd (Plus x y) v = evalAd x v + evalAd y v
evalAd (Times x y) v = evalAd x v * evalAd y v
#+END_SRC
In this point-free setting, differentiation of an expression is a breeze.
The =diff= function differentiates an expression with respect to the \(i\)-th input variable.
#+BEGIN_SRC haskell
diff :: AdExpr -> Int -> AdExpr
diff (Plus x y) i = Plus (diff x i) (diff y i)
diff (Times x y) i = Plus (Times (diff x i) y) (Times x (diff y i))
diff (Constant _) _ = Constant 0.0
diff (Pi i) j = if i == j then Constant 1.0 else Constant 0.0
#+END_SRC
Now that we can differentiate with respect to an individual variable, we can now compute the gradient and Jacobian of functions.
We use the =domainDim= function to compute how many "variables" an expression depends on.
#+BEGIN_SRC haskell
grad :: AdExpr -> [AdExpr]
grad expr = map (diff expr) [0..domainDim expr - 1]

jacobian :: [AdExpr] -> [[AdExpr]]
jacobian expr = map grad' expr
  where dim = max 0 . decf . maximum $ map domainDim expr
        decf x = x-1
        grad' e = map (diff e) [0..dim]

domainDim :: AdExpr -> Int
domainDim expr = if count == 0 then 0 else 1 + count
  where count = go expr 0
        go (Pi i) j = max i j
        go (Constant _) j = j
        go (Plus x y) j = max (go x j) (go y j)
        go (Times x y) j = max (go x j) (go y j)
#+END_SRC
Finally, we'll define list-based matrix multiplication.
#+BEGIN_SRC haskell
matMatMul :: Num a => [[a]] -> [[a]] -> [[a]]
matMatMul a b =
 [[ sum $ zipWith (*) ar bc | bc <- (transpose b) ] | ar <- a]
#+END_SRC

With this infrastructure, we can define an "efficient" parallelizable implementation of the chain rule, assuming our function train was broken up in such a way that each piece's Jacobian can be evaluated in parallel.
#+BEGIN_SRC haskell
chain :: [AdExpr] -> [AdExpr] -> [Double] -> [[Double]]
chain f g a = matMatMul jfga jga
  where ga = map (evalAd' a) g
        jga = map (map $ evalAd' a) $ jacobian g
        jfga = map (map $ evalAd' ga) $ jacobian f
        evalAd' = flip evalAd
#+END_SRC

As an example, we'll define two functions.
#+BEGIN_SRC haskell
foo :: [AdExpr]
foo =
  let
    x = Pi 0
    y = Pi 1
    z = Pi 2
  in [y*z + x*z + x*y, x*x + y*y + z*z]

bar :: [AdExpr]
bar =
  let
    u = Pi 0
    v = Pi 1
  in
    [u*u+2*v, v*v*v+u]
#+END_SRC
and compute the Jacobian of their composition.
#+BEGIN_SRC haskell
λ> chain bar foo [1,2,3]
[[114.0,96.0,78.0],[1181.0,2356.0,3531.0]]
#+END_SRC
We can also define a function to evaluate the Jacobian of a train of function compositions.
(In the real implementation, this is another space for optimization. Unlike the Jacobian accumulation problem, there are [[https://en.wikipedia.org/wiki/Matrix_chain_multiplication][efficient algorithms]] for solving the matrix chain multiplication problem.)
#+BEGIN_SRC haskell
pipeline :: [[AdExpr]] -> [Double] -> [[Double]]
pipeline [f] v = map (map $ flip evalAd v) $ jacobian f
pipeline (f:fs) gv = matMatMul rest jf
  where rest = pipeline fs $ map (flip evalAd gv) f
        jf = map (map $ flip evalAd gv) $ jacobian f
#+END_SRC

