_posts/2018-05-26-intro-to-combinatory-ad.org
* Conclusion

In this blog post, I've described what I hope to achieve over the summer, and provided a proof-of-concept implementation for the combinatory AD method.
In future blog posts, I will tackle additional related topics, including the following.
- Optimization/avoiding expression swell
- Integration with =accelerate=
- Dealing with variables
- Benchmarks
- Integration with linear algebra primitives
