_posts/2018-05-26-intro-to-combinatory-ad.html

<div id="outline-container-org558b637" class="outline-2">
<h2 id="org558b637">Conclusion</h2>
<div class="outline-text-2" id="text-org558b637">
<p>
In this blog post, I've described what I hope to achieve over the summer, and provided a proof-of-concept implementation for the combinatory AD method.
In future blog posts, I will tackle additional related topics, including the following.
</p>
<ul class="org-ul">
<li>Optimization/avoiding expression swell</li>
<li>Integration with <code>accelerate</code></li>
<li>Dealing with variables</li>
<li>Benchmarks</li>
<li>Integration with linear algebra primitives</li>
</ul>
</div>
</div>
